singhanil2004/RL78_Kwh_Meter/rl78i1c/application/calibration/r_calib_sampling.c
/******************************************************************************
* DISCLAIMER

* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized.

* This software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.

* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES
* REGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY,
* INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
* PARTICULAR PURPOSE AND NON-INFRINGEMENT.  ALL SUCH WARRANTIES ARE EXPRESSLY
* DISCLAIMED.

* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES
* FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS
* AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.

* Renesas reserves the right, without notice, to make changes to this
* software and to discontinue the availability of this software.
* By using this software, you agree to the additional terms and
* conditions found by accessing the following link:
* http://www.renesas.com/disclaimer
******************************************************************************/
/* Copyright (C) 2011 Renesas Electronics Corporation. All rights reserved.  */
/******************************************************************************
* File Name    : r_calib_sampling.c
* Version      : 1.00
* Device(s)    : None
* Tool-Chain   :
* H/W Platform : Unified Energy Meter Platform
* Description  :
******************************************************************************
* History : DD.MM.YYYY Version Description
*         : 01.04.2013
******************************************************************************/

/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
/* Driver */
#include "r_cg_macrodriver.h"   /* Macro Driver Definitions */

/* Middleware */
#include "typedef.h"            /* GSCE Standard Typedef */

#include "em_core.h"            /* EM Core APIs */
#include "em_conversion.h"      /* EM Conversion APIs */
#include "em_maths.h"           /* EM Maths APIs */
#include "em_type.h"

/* Wrapper */
#include "wrp_em_wdt.h"         /* Wrapper EM WDT */
#include "wrp_em_adc.h"         /* Wrapper EM ADC */
#include "wrp_mcu.h"            /* Wrapper MCU */
#include "wrp_em_adc_data.h"    /* Wrapper EM ADC data */
#include "wrp_em_sw_config.h"   /* SW config info, store ADC channels mapping */
#include "rl78i1c_sw_hpf.h"
/* Application */
#include <string.h>             /* Standard string lib */
#include <math.h>               /* Standard mathematics lib */
#include "platform.h"           /* Platform definition */
#include "r_calib_sampling.h"   /* Sampling for auto calibration */
#include "r_calib.h"            /* Calculation */


/* Driver layer */

/******************************************************************************
Macro definitions
******************************************************************************/
/*
 * Specify mask value for sampling, un-define if not use.
 */
#define EM_CALIB_MASK_OFF_NOISY_BITS_POSITIVE           (0xF0)
#define EM_CALIB_MASK_OFF_NOISY_BITS_NEGATIVE           (0x0F)

/* Function macro definition */
#define EM_CALIB_ADC_GetGainAndPhaseValue(adc_info)     R_DSADC_GetGainAndPhase((dsad_reg_setting_t*) adc_info)
#define EM_CALIB_ADC_RestoreGainAndPhaseValue(adc_info) R_DSADC_SetGainAndPhase(adc_info)

/* Constant for sampling frequeny calculation */
#define EM_CALIB_FIXED_FSUB                     (32.768f)   /* Fixed value of sub clock */

/* Constant number of sample for gain calculation */
#define EM_CALIB_NUM_SAMPLE_FOR_CALC_GAIN       (100)       /* Its value is >= (fs / 45hz) */

/* Phase shift approximation system */
#define EM_CALIB_PHASE_ERROR_STOP_THRESHOLD     (0.0125f)       /* Stop threshold for delta error calculation */
#define EM_CALIB_PHASE_ERROR_MIN_THRESHOLD      (-0.59529951f)  /* Min threshold for delta error calculation */
#define EM_CALIB_PHASE_ERROR_MAX_THRESHOLD      (1.470963154f)  /* Max threshold for delta error calculation */
#define EM_CALIB_PHASE_ERROR_MAX_ANGLE_ERR      (13.812f)       /* Max abs angle error for setting into Phase Control Register */

/* Phase shift step on I1C device */
#if ((defined EM_CALIB_LINE_FREQUENCY) && (EM_CALIB_LINE_FREQUENCY == 50))
#define EM_CALIB_PHASE_SHIFT_STEP               (0.0120f)
#elif ((defined EM_CALIB_LINE_FREQUENCY) && (EM_CALIB_LINE_FREQUENCY == 48))
#define EM_CALIB_PHASE_SHIFT_STEP               (0.01152f)
#elif ((defined EM_CALIB_LINE_FREQUENCY) && (EM_CALIB_LINE_FREQUENCY == 52))
#define EM_CALIB_PHASE_SHIFT_STEP               (0.01248f)
#elif ((defined EM_CALIB_LINE_FREQUENCY) && (EM_CALIB_LINE_FREQUENCY == 60))
#define EM_CALIB_PHASE_SHIFT_STEP               (0.0144f)
#else
#error "Not select current line frequency"
#endif /* (defined EM_CALIB_LINE_FREQUENCY) && (EM_CALIB_LINE_FREQUENCY == 50) */

#define EM_CALIB_QUARTER_SHIFT_PHASE_SELECT     (LINE_PHASE_B)

/* Accumulation step definitions */
#define EM_CALIB_ACCUMULATE_STEP_V              (0x01)  /* Choose Voltage on this step */
#define EM_CALIB_ACCUMULATE_STEP_IP             (0x02)  /* Choose Phase current on this step */
#define EM_CALIB_ACCUMULATE_STEP_IN             (0x04)  /* Choose Neutral current on this step */

#define EM_CALIB_ACCUMULATE_STEP_FS             (0x08)  /* Accumulate to calculate fs */
#define EM_CALIB_ACCUMULATE_STEP_IGAIN          (0x10)  /* Accumulate to calculate phase gain */
#define EM_CALIB_ACCUMULATE_STEP_PHASE_ANGLE    (0x20)  /* Choose Phase angle error on this step */
#define EM_CALIB_ACCUMULATE_STEP_NEUTRAL_ANGLE  (0x40)  /* Choose Neutral angle error on this step */
#define EM_CALIB_ACCUMULATE_STEP_V90_ANGLE      (0x80)  /* Choose V90 angle error on this step */

