singhanil2004/RL78_Kwh_Meter/rl78i1c/application/calibration/r_calib_sampling.c
/*
 * The steps length to do +59.90 and -59.90
 * This setting is according to sampling frequency of DSAD module
 */
#define EM_CALIB_PI                             (3.141592654f)                      /* PI */

#if (EM_CALIB_LINE_FREQUENCY == 50)

#define EM_CALIB_CIRCLE_DELAY_STEP              (13)                                /* 13 step ~ 59.904 degree */
#define EM_CALIB_CIRCLE_LENGTH                  (EM_CALIB_CIRCLE_DELAY_STEP + 1)    /* 1 more for buffer */
#define EM_CALIB_C                              (1.045522035f)                      /* C in Rad of 59.904 degree */
#define EM_CALIB_SIN2C                          (0.867696054f)                      /* Sin(2C) */
#define EM_CALIB_TANC                           (1.725368131f)                      /* Tan(C) */

#elif (EM_CALIB_LINE_FREQUENCY == 48)

#define EM_CALIB_CIRCLE_DELAY_STEP              (13)                                /* 13 step ~ 59.904 degree */
#define EM_CALIB_CIRCLE_LENGTH                  (EM_CALIB_CIRCLE_DELAY_STEP + 1)    /* 1 more for buffer */
#define EM_CALIB_C                              (1.003701154f)                      /* C in Rad of 59.904 degree */
#define EM_CALIB_SIN2C                          (0.906192096f)                      /* Sin(2C) */
#define EM_CALIB_TANC                           (1.570159659f)                      /* Tan(C) */

#elif (EM_CALIB_LINE_FREQUENCY == 52)

#define EM_CALIB_CIRCLE_DELAY_STEP              (12)                                /* 13 step ~ 59.904 degree */
#define EM_CALIB_CIRCLE_LENGTH                  (EM_CALIB_CIRCLE_DELAY_STEP + 1)    /* 1 more for buffer */
#define EM_CALIB_C                              (1.003701154f)                      /* C in Rad of 59.904 degree */
#define EM_CALIB_SIN2C                          (0.906192096f)                      /* Sin(2C) */
#define EM_CALIB_TANC                           (1.570159659f)                      /* Tan(C) */

#elif (EM_CALIB_LINE_FREQUENCY == 60)

#define EM_CALIB_CIRCLE_DELAY_STEP              (10)                                /* 13 step ~ 59.904 degree */
#define EM_CALIB_CIRCLE_LENGTH                  (EM_CALIB_CIRCLE_DELAY_STEP + 1)    /* 1 more for buffer */
#define EM_CALIB_C                              (0.965097263f)                      /* C in Rad of 59.904 degree */
#define EM_CALIB_SIN2C                          (0.936108653f)                      /* Sin(2C) */
#define EM_CALIB_TANC                           (1.443968007f)                      /* Tan(C) */

#endif /* EM_CALIB_LINE_FREQUENCY == 50 */

#define ABS(x)                                  ((x) <  0  ? (-(x)) : (x))
#define EM_CALIB_DERIVATION_NUM_DATA            27

#define EM_CALIB_OFFSET_CYCLE_FOR_AVERAGE       10
#define EM_CALIB_OFFSET_DEFAULT_NSAMPLE         (EM_CALIB_OFFSET_CYCLE_FOR_AVERAGE * 90)    /* min 45 Hz line supply */
#define EM_CALIB_OFFSET_STABILIZATION_COUNT     5

#define EM_CALIB_SIGNAL_CYCLE_FOR_STABILITY     (1000)

/******************************************************************************
Typedef definitions
******************************************************************************/

/******************************************************************************
Imported global variables and functions (from other files)
******************************************************************************/

/******************************************************************************
Exported global variables and functions (to be accessed by other files)
******************************************************************************/
/* Calib information */
calib_data_t        g_calib_info;

static uint8_t      g_calib_line = 0;
static uint32_t     g_calib_number_cycles;
static uint16_t     g_calib_number_cycles_phase_error;
static float32_t    g_calib_volt;
static float32_t    g_calib_current;
static float32_t    g_calib_imax;
static dsad_channel_t   g_calib_channel;
static uint8_t      g_calib_step;
static uint8_t      g_calib_is_start_count_sample = 0;
static uint8_t      g_calib_start_count_1s = 0;
static uint8_t      g_calib_is_first_accumulate;

/* Phase shift calculation array 0 */
static int8_t       g_calib_phase_shift0_pos;
static uint8_t      g_calib_phase_shift0_ready_count;
static int8_t       g_calib_phase_shift0_ready;
static int32_t      g_calib_phase_shift0_circle[EM_CALIB_CIRCLE_LENGTH];

/* Phase shift calculation array 1 */
static int8_t       g_calib_phase_shift1_pos;
static uint8_t      g_calib_phase_shift1_ready_count;
static int8_t       g_calib_phase_shift1_ready;
static int32_t      g_calib_phase_shift1_circle[EM_CALIB_CIRCLE_LENGTH];

static uint8_t      g_is_quarter_shift_calibrate;

static int16_t      g_sample_v;
static int16_t      g_sample_v90;
static int32_t      g_sample_i;

/* Storage to backup ADC register setting */
static dsad_reg_setting_t   g_calib_adc_reg_setting;

/******************************************************************************
Private global variables and functions
******************************************************************************/

/* Commons */
static void EM_CALIB_ResetPhaseShiftCircle(void);
static int32_t EM_CALIB_DoPhaseShift0(int32_t signal, uint8_t step);
static int32_t EM_CALIB_DoPhaseShift1(int32_t signal, uint8_t step);
static float32_t EM_CALIB_LookupDerivation(float32_t angle);
static float32_t EM_CALIB_GetAccumulatedValue(acc24_t* p_msb);
static uint8_t EM_CALIB_ConvertIntoADCGain(uint8_t calc_gain);

/* Calibration wrapper definition */
static uint8_t EM_CALIB_ADC_SetCurrentGain(uint8_t gain);
static void EM_CALIB_ADC_SetAngleError(float32_t angle);
static void EM_CALIB_ADC_Start(void);

/* Accumulation & sampling */
static uint8_t EM_CALIB_DoAccumulationSignals(uint8_t steps);
static uint8_t EM_CALIB_DoAccumulateAngleError(uint8_t steps);
static uint8_t EM_CALIB_DoAccumulateAngle90Error(uint8_t steps);

static void EM_CALIB_SamplingUpdateOffset(void);
static void EM_CALIB_SamplingForFs(void);
static void EM_CALIB_SamplingForCalcGain(void);
static void EM_CALIB_SamplingForAngleError(void);
static void EM_CALIB_SamplingForAccSignals(void);
static void EM_CALIB_SamplingForAngle90Error(void);

