singhanil2004/RL78_Kwh_Meter/rl78i1c/application/calibration/r_calib_sampling.c
/******************************************************************************
* Function Name : EM_CALIB_ResetPhaseShiftCircle
* Interface     : static void EM_CALIB_ResetPhaseShiftCircle(void)
* Description   : Reset angle shifting circle and all related flags
* Arguments     : None
* Function Calls: none
* Return Value  : none
******************************************************************************/
static void EM_CALIB_ResetPhaseShiftCircle(void)
{
    memset(g_calib_phase_shift0_circle, 0, EM_CALIB_CIRCLE_LENGTH * sizeof(int32_t));
    memset(g_calib_phase_shift1_circle, 0, EM_CALIB_CIRCLE_LENGTH * sizeof(int32_t));
    
    g_calib_phase_shift0_pos         = 0;
    g_calib_phase_shift0_ready       = 0;
    g_calib_phase_shift0_ready_count = 0;
    
    g_calib_phase_shift1_pos         = 0;
    g_calib_phase_shift1_ready       = 0;
    g_calib_phase_shift1_ready_count = 0;
}

/******************************************************************************
* Function Name : EM_CALIB_DoPhaseShift0
* Interface     : static int32_t EM_CALIB_DoPhaseShift0(int32_t signal, uint8_t step)
* Description   : Execute shifting input single 90 degree
* Arguments     : int32_t signal: shifted signal
*               : uint8_t step  : expected steps to archive 90 degree shifting
* Function Calls: none
* Return Value  : shifted signal
******************************************************************************/
static int32_t EM_CALIB_DoPhaseShift0(int32_t signal, uint8_t step)
{
    /* PUSH: Add the signal into the data circle at circlepos position */
    g_calib_phase_shift0_circle[g_calib_phase_shift0_pos] = signal;
    
    /* POP: Get the signal from data circle from (g_calib_phase_shift_pos + steps) position */
    signal = g_calib_phase_shift0_circle[(g_calib_phase_shift0_pos + step) % EM_CALIB_CIRCLE_LENGTH];
    
    g_calib_phase_shift0_pos--;     /* Scroll the circle, scroll left */
    
    if (g_calib_phase_shift0_pos == -1)
    {
        g_calib_phase_shift0_pos   = EM_CALIB_CIRCLE_LENGTH - 1;
    }
    
    if (g_calib_phase_shift0_ready_count >= EM_CALIB_CIRCLE_LENGTH + 1)
    {
        g_calib_phase_shift0_ready = 1;
    }
    else
    {
        g_calib_phase_shift0_ready_count++;
    }
    
    return signal;
}

/******************************************************************************
* Function Name : EM_CALIB_DoPhaseShift1
* Interface     : static int32_t EM_CALIB_DoPhaseShift1(int32_t signal, uint8_t step)
* Description   : Execute shifting input single 90 degree
* Arguments     : int32_t signal: shifted signal
*               : uint8_t step  : expected steps to archive 90 degree shifting
* Function Calls: none
* Return Value  : shifted signal
******************************************************************************/
static int32_t EM_CALIB_DoPhaseShift1(int32_t signal, uint8_t step)
{
    /* PUSH: Add the signal into the data circle at circlepos position */
    g_calib_phase_shift1_circle[g_calib_phase_shift1_pos] = signal;
    
    /* POP: Get the signal from data circle from (g_calib_phase_shift_pos + steps) position */
    signal = g_calib_phase_shift1_circle[(g_calib_phase_shift1_pos + step) % EM_CALIB_CIRCLE_LENGTH];
    
    g_calib_phase_shift1_pos--;     /* Scroll the circle, scroll left */
    
    if (g_calib_phase_shift1_pos == -1)
    {
        g_calib_phase_shift1_pos   = EM_CALIB_CIRCLE_LENGTH - 1;
    }
    
    if (g_calib_phase_shift1_ready_count >= EM_CALIB_CIRCLE_LENGTH + 2)
    {
        g_calib_phase_shift1_ready = 1;
    }
    else
    {
        g_calib_phase_shift1_ready_count++;
    }
    
    return signal;
}

/******************************************************************************
* Function Name : EM_CALIB_SamplingForAngleErr
* Interface     : static void EM_CALIB_SamplingForAngleErr(void)
* Description   : Lookup to get derivation value
* Arguments     : None
* Function Calls: None
* Return Value  : None
******************************************************************************/
static float32_t EM_CALIB_LookupDerivation(float32_t angle)
{
    volatile float32_t cos_xc;
    
    /* -sin(2C) / cos^2(x+C), x in Rad */
    angle  *= EM_CALIB_PI;
    angle  /= 180.0f;
    cos_xc  = cosf(angle + EM_CALIB_C);
    
    return (-EM_CALIB_SIN2C / (cos_xc * cos_xc));
}

/******************************************************************************
* Function Name : EM_CALIB_GetAccumulatedValue
* Interface     : float32_t EM_CALIB_GetAccumulatedValue(acc24_t *p_acc)
* Description   : Get the accumulator value from MSB and LSB parts
* Arguments     : acc24_t * p_acc: pointer to (acc24_t)
* Function Calls: EM_ACC24_GetFloatValue
* Return Value  : float32_t, combined value from MSB and LSB
******************************************************************************/
static float32_t EM_CALIB_GetAccumulatedValue(acc24_t* p_acc)
{
    volatile float32_t result = 0;
    
    if (p_acc != NULL)
    {
        result += EM_ACC24_GetFloatValue(p_acc);
    }
    
    return result;
}

/******************************************************************************
* Function Name : EM_CALIB_ConvertIntoADCGain
* Interface     : static uint8_t EM_CALIB_ConvertIntoADCGain(uint8_t calc_gain)
* Description   : Convert the calculated current gain into suitable value to set into ADC module
* Arguments     : Calculated current gain
* Function Calls: None
* Return Value  : The appropriate gain for ADC module
******************************************************************************/
static uint8_t EM_CALIB_ConvertIntoADCGain(uint8_t calc_gain)
{
    if (calc_gain < 2)
    {
        return 1;
    }
    else if (calc_gain < 4)
    {
        return 2;
    }
    else if (calc_gain < 8)
    {
        return 4;
    }
    else if (calc_gain < 16)
    {
        return 8;
    }
    else if (calc_gain < 32)
    {
        return 16;
    }
    else
    {
        return 32;
    }
}

/******************************************************************************
* Function Name : EM_CALIB_ADC_SetCurrentGain
* Interface     : static uint8_t static uint8_t EM_CALIB_ADC_SetCurrentGain(uint8_t gain)(uint8_t gain)
* Description   : Set current gain into ADC HW module
* Arguments     : gain : Gain value used to set into ADC driver
* Function Calls: R_ADC_SetChannelGain()
* Return Value  : Status of HW setting gain
******************************************************************************/
static uint8_t EM_CALIB_ADC_SetCurrentGain(uint8_t gain)
{
    volatile uint16_t    status;
    volatile dsad_gain_t     gain_value;
    
    if (gain == 1)
    {
        gain_value = GAIN_X1;
    }
    else if (gain == 2)
    {
        gain_value = GAIN_X2;
    }
    else if (gain == 4)
    {
        gain_value = GAIN_X4;
    }
    else if (gain == 8)
    {
        gain_value = GAIN_X8;
    }
    else if (gain == 16)
    {
        gain_value = GAIN_X16;
    }
    else
    {
        gain_value = GAIN_X32;
    }
    
    status = R_DSADC_SetChannelGain(g_calib_channel, gain_value);
    
