singhanil2004/RL78_Kwh_Meter/rl78i1c/application/calibration/r_calib_sampling.c
    return status;
}

/******************************************************************************
* Function Name : EM_CALIB_ADC_SetAngleError
* Interface     : static void EM_CALIB_ADC_SetAngleError(float32_t angle)
* Description   : Shift volt/phase channel due to the set channel and angle
* Arguments     : angle: shifted angle
* Function Calls: R_ADC_AdjustPhaseDelay()
* Return Value  : None
******************************************************************************/
static void EM_CALIB_ADC_SetAngleError(float32_t angle)
{
    if (angle < 0)
    {
        /* Shift phase channel */
        R_DSADC_AdjustPhaseDelay(
            g_calib_channel,
            (uint16_t)((-angle) / EM_CALIB_PHASE_SHIFT_STEP)
        );
    }
    else
    {
        /* fatal error here: must ensure current channel lead SAR-ADC voltage channel */
    }
}


/******************************************************************************
* Function Name : EM_CALIB_ADC_Start
* Interface     : static void EM_CALIB_ADC_Start(uint8_t is_phase)
* Description   : Start ADC due to the calibrated current channel
* Arguments     : is_phase : 1 is calibrate phase channel
*               :          : 0 is calibrate neutral channel
* Function Calls: R_ADC_StartWithoutGainAndPhase()
* Return Value  : None
******************************************************************************/
static void EM_CALIB_ADC_Start(void)
{
#if 0
    R_DSADC_StartWithoutGainAndPhase(_0F0F_DSAD_ENABLE_ALLCH);
#else
    EM_ADC_Start();
    
    RL78I1C_ResetSoftwareHPF16(0);
    RL78I1C_ResetSoftwareHPF16(1);
    RL78I1C_ResetSoftwareHPF16(2);
    RL78I1C_ResetSoftwareHPF16(3);
    RL78I1C_ResetSoftwareHPF16(4);
    RL78I1C_ResetSoftwareHPF16(5);
    
    R_DSADC_SetChannelGain(DSADCHANNEL0, GAIN_X1);
    R_DSADC_SetChannelGain(DSADCHANNEL1, GAIN_X1);
    R_DSADC_SetChannelGain(DSADCHANNEL2, GAIN_X1);
    R_DSADC_SetChannelGain(DSADCHANNEL3, GAIN_X1);
    
    R_DSADC_AdjustPhaseDelay(DSADCHANNEL0, 0);
    R_DSADC_AdjustPhaseDelay(DSADCHANNEL1, 0);
    R_DSADC_AdjustPhaseDelay(DSADCHANNEL2, 0);
    R_DSADC_AdjustPhaseDelay(DSADCHANNEL3, 0);
    
    EM_WDT_Restart();
    //R_WDT_Restart();
    MCU_Delay(1000);
    //    R_DSADC_SetHighPassFilterOff(DSADCHANNEL0);
    //    R_DSADC_SetHighPassFilterOff(DSADCHANNEL1);
    //    R_DSADC_SetHighPassFilterOff(DSADCHANNEL2);
    //    R_DSADC_SetHighPassFilterOff(DSADCHANNEL3);
    
#endif /* 0 or 1 */
}

/******************************************************************************
* Function Name : EM_CALIB_Init
* Interface     : uint8_t EM_CALIB_Init(void)
* Description   : Initialize auto calibration module
* Arguments     : None
* Function Calls: EM_WDT_Init()
*               : EM_ADC_Init()
* Return Value  : None
******************************************************************************/
void EM_CALIB_Init(void)
{
    /* Initialize HW modules */
    EM_WDT_Init();              /* Initialize WDT module */
    EM_ADC_Init();              /* Initialize 24bit - Delta Sigma ADC module */
}

/******************************************************************************
* Function Name : EM_CALIB_Start
* Interface     : void EM_CALIB_Start(
*               :     float32_t imax,
*               :     float32_t volt,
*               :     float32_t current,
*               :     uint16_t cycles,
*               :     uint16_t cycles_phase_error,
*               :     uint8_t is_phase
*               : );
* Description   : Start auto calibration
* Arguments     : imax              : Max supported measured current of MCU
*               : volt              : Calibrated voltage
*               : current           : Calibrated current
*               : cycles            : Expected total number cycles for sampling
*               : cycle_phase_error : Expected total number cycles for phase error sampling
*               : is_phase: 1 is Phase, 0 is Neutral
* Function Calls: EM_CALIB_ADC_GetGainAndPhaseValue()
*               : EM_CALIB_ResetPhaseShiftCircle()
*               : EM_CALIB_ADC_Start()
*               : EM_WDT_Start()
*               : MCU_Delay()
*               : EM_WDT_Restart()
* Return Value  : None
******************************************************************************/
void EM_CALIB_Start(
    float32_t imax,
    float32_t volt,
    float32_t current,
    uint16_t cycles,
    uint16_t cycles_phase_error,
    uint8_t line
)
{
    volatile uint8_t i;
    
    /* Reset data storage */
    memset(&g_calib_info, 0, sizeof(g_calib_info));
    memset(&g_calib_adc_reg_setting, 0, sizeof(g_calib_adc_reg_setting));
    g_calib_step = 0;
    g_calib_is_first_accumulate = 0;
    
    g_calib_info.offset.v.average = 512;
    g_calib_info.offset.i.average = 60000;
    
    
    g_calib_info.offset.v.average_prev = 512;
    g_calib_info.offset.i.average_prev = 60000;
    
    /* Get original value of HW */
    EM_CALIB_ADC_GetGainAndPhaseValue(&g_calib_adc_reg_setting);
    
    /* Reset Phase shift circle */
    EM_CALIB_ResetPhaseShiftCircle();
    
    /* Get calibrated information */
    g_calib_volt                        = volt;
    g_calib_current                     = current;
    g_calib_number_cycles               = cycles;
    g_calib_number_cycles_phase_error   = cycles_phase_error;
    g_calib_imax                        = imax;
    g_calib_line                        = line;
    
    g_calib_channel = (dsad_channel_t)(line);
    
    if (line == EM_CALIB_QUARTER_SHIFT_PHASE_SELECT)
    {
        g_is_quarter_shift_calibrate = 1;
    }
    else
    {
        g_is_quarter_shift_calibrate = 0;
    }
    
    /* Start HW modules */
    EM_CALIB_ADC_Start();   /* Start DSAD module for calibration */
    EM_WDT_Start();
    
    /* Wait until ADC offset stabilized */
    while (g_calib_info.stable_count < EM_CALIB_SIGNAL_CYCLE_FOR_STABILITY)
    {
        EM_WDT_Restart();
    }
}

/******************************************************************************
* Function Name : EM_CALIB_Stop
* Interface     : void EM_CALIB_Stop()
* Description   : Stop auto calibration
* Arguments     : None
* Function Calls: EM_ADC_Stop()
*               : EM_CALIB_ADC_RestoreGainAndPhaseValue()
* Return Value  : None
******************************************************************************/
void EM_CALIB_Stop(void)
{
    /* Stop HW modules */
    EM_ADC_Stop();
    
    /* Restore original value of HW */
    EM_CALIB_ADC_RestoreGainAndPhaseValue(g_calib_adc_reg_setting);
}

