singhanil2004/RL78_Kwh_Meter/rl78i1c/application/calibration/r_calib_sampling.c
/******************************************************************************
* Function Name : EM_CALIB_CalculateSamplingFrequency
* Interface     : float32_t EM_CALIB_CalculateSamplingFrequency(void)
* Description   : Calculate actual sampling frequency of DSAD
* Arguments     : None
* Function Calls: None
* Return Value  : Calculated sampling frequency
******************************************************************************/
float32_t EM_CALIB_CalculateSamplingFrequency(void)
{
    /* Set sampling step for sampling process */
    g_calib_step = EM_CALIB_ACCUMULATE_STEP_FS;
    
    /* Clear the number ADC ISR counter */
    g_calib_info.fs.nsample = 0;
    
    g_calib_start_count_1s = 1;
    /* Wait until finish sampling process */
    g_calib_info.fs.is_done = 0;
    
    while (g_calib_info.fs.is_done == 0)
    {
        EM_WDT_Restart();
    }
    
    g_calib_start_count_1s = 0;
    return (g_calib_info.fs.nsample);
}

/******************************************************************************
* Function Name : EM_CALIB_CalculateCurrentGain
* Interface     : static float32_t EM_CALIB_CalculateCurrentGain(void)
* Description   : Calculate and return phase/neutral current gain
*               : Then set the calculated value into ADC module
* Arguments     : None
* Function Calls: EM_CALIB_ConvertIntoADCGain()
*               : EM_CALIB_ADC_SetCurrentGain()
* Return Value  : Calculated current gain
******************************************************************************/
float32_t EM_CALIB_CalculateAndSetCurrentGain(void)
{
    volatile float32_t   amplified_const;
    volatile uint8_t     igain = 0;
    
    g_calib_step = EM_CALIB_ACCUMULATE_STEP_IGAIN;
    
    /* Reset acknowledged flag */
    g_calib_info.gain.idone = 0;
    g_calib_info.gain.is_start = 0;
    
    /* Wait until finish sampling process */
    while (g_calib_info.gain.idone == 0)
    {
        EM_WDT_Restart();
    }
    
    /*
     *          Calculation explanation
     *  Gain is used to make DSAD result reach Max Full Scale at MAX_SUPPORTED_CURRENT
     *                                      *Gain
     *  MAX_SUPPORTED_CURRENT   --> Amax[LSB] -------> 2^24 [LSB] Full scale of DSAD
     *                 2^24
     *  --> Gain = ------------
     *              Amax [LSB]
     *  And:
     *  MAX_SUPPORTED_CURRENT   -->      Amax       [LSB]
     *       calib_current      -->      Imax   [LSB]
     *         MAX_SUPPORTED_CURRENT
     *  Amax = --------------------- * Imax
     *            calib_current
     *                        2^24                          2^24
     *  --> Gain = ----------------------------- = ----------------------
     *             MAX_SUPPORTED_CURRENT            amplified_val * Imax
     *             --------------------- * Imax
     *             calib_current
     */
    /* Calculate current gain */
    amplified_const = g_calib_imax / g_calib_current;
    igain = (uint8_t)(pow(2, 23) / (g_calib_info.gain.imax * amplified_const));
    
    igain = EM_CALIB_ConvertIntoADCGain(igain);
    
    EM_CALIB_ADC_SetCurrentGain(igain);
    return igain;
}

/******************************************************************************
* Function Name : EM_CALIB_DoAccumulate
* Interface     : uint8_t EM_CALIB_DoAccumulate(void)
* Description   : Control accumulation process of v, i1, i2 channels
*               : Control angle error calculation
* Arguments     : None
* Function Calls: EM_CALIB_DoAccumulationSignals()
*               : EM_CALIB_DoAccumulateAngleError()
* Return Value  : None
******************************************************************************/
uint8_t EM_CALIB_DoAccumulate(void)
{
    volatile uint8_t result = EM_CALIB_OK;
    
    if (g_calib_line < 3)
    {
        /* Accumulate signals */
        result |= EM_CALIB_DoAccumulationSignals(EM_CALIB_ACCUMULATE_STEP_V | EM_CALIB_ACCUMULATE_STEP_IP);
        /* Accumulate phase angle error */
        result |= EM_CALIB_DoAccumulateAngleError(EM_CALIB_ACCUMULATE_STEP_PHASE_ANGLE);
        
        if (g_calib_is_first_accumulate == 0)
        {
            /* 90 degree sample calibration only when use reactive */
#ifdef METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE
            if (g_is_quarter_shift_calibrate == 1)
            {
                /* Accumulate v90 angle error */
                result |= EM_CALIB_DoAccumulateAngle90Error(EM_CALIB_ACCUMULATE_STEP_V90_ANGLE);
            }
            
#endif /* METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE */
            g_calib_is_first_accumulate = 1;
        }
    }
    else
    {
        /* Accumulate signals */
        result |= EM_CALIB_DoAccumulationSignals(EM_CALIB_ACCUMULATE_STEP_IP);
    }
    
    return result;
}

/******************************************************************************
* Function Name : EM_CALIB_DoAccumulationSignals
* Interface     : static uint8_t EM_CALIB_DoAccumulationSignals(uint8_t steps)
* Description   : Control accumulation process
* Arguments     : uint8_t step: choose channels to accumulate
* Function Calls: EM_ACC24_Clear()
*               : EM_CALIB_GetAccumulatedValue()
* Return Value  : EM_CALIB_ERROR : input argument wrong
*               : EM_CALIB_OK    : input argument OK
******************************************************************************/
static uint8_t EM_CALIB_DoAccumulationSignals(uint8_t steps)
{
    /* Only do for the V, Ip, In */
    if ((steps < EM_CALIB_ACCUMULATE_STEP_V)        ||  /* Choose nothing */
        (steps > (EM_CALIB_ACCUMULATE_STEP_V      |
                  EM_CALIB_ACCUMULATE_STEP_IP     |
                  EM_CALIB_ACCUMULATE_STEP_IN))
       )   /* Get samples of V, IP and IN channels */
    {
        return EM_CALIB_ERROR;
    }
    
    /* Clear storage */
    /* Voltage */
    g_calib_info.storage.vrms   = 0;
    g_calib_info.storage.nvrms  = 0;
    /* Phase */
    g_calib_info.storage.i1rms  = 0;
    g_calib_info.storage.ni1rms = 0;
    /* Neutral */
    g_calib_info.storage.i2rms  = 0;
    g_calib_info.storage.ni2rms = 0;
    
    /* Clear accumulator */
    /* Voltage signal */
    EM_ACC24_Clear(&g_calib_info.acc.vrms);
    g_calib_info.acc.nvrms = 0;
    /* Phase signal */
    EM_ACC24_Clear(&g_calib_info.acc.i1rms);
    g_calib_info.acc.ni1rms = 0;
    /* Neutral signal */
    EM_ACC24_Clear(&g_calib_info.acc.i2rms);
    g_calib_info.acc.ni2rms = 0;
    
