singhanil2004/RL78_Kwh_Meter/rl78i1c/application/calibration/r_calib_sampling.c
    /* Reset data storage for auto calibration */
    g_calib_info.number_of_cycles = 0;
    g_calib_info.v_start_flag  = 0;
    g_calib_info.i1_start_flag = 0;
    g_calib_info.i2_start_flag = 0;
    g_calib_info.acc.is_done = 0;
    
    /* Choose accumulated signal, Start sampling process for accumulation */
    g_calib_step = steps;
    
    /* Assign accumulated value into Storage */
    while (g_calib_info.acc.is_done == 0)
    {
        EM_WDT_Restart();
    }
    
    /*
     * Voltage signal
     */
    g_calib_info.storage.vrms = EM_CALIB_GetAccumulatedValue(
                                    &g_calib_info.acc.vrms
                                );
    g_calib_info.storage.nvrms = g_calib_info.acc.nvrms;
    
    /*
     * Phase signal
     */
    g_calib_info.storage.i1rms = EM_CALIB_GetAccumulatedValue(
                                     &g_calib_info.acc.i1rms
                                 );
    g_calib_info.storage.ni1rms = g_calib_info.acc.ni1rms;
    
    /*
     * Neutral signal
     */
    g_calib_info.storage.i2rms = EM_CALIB_GetAccumulatedValue(
                                     &g_calib_info.acc.i2rms
                                 );
    g_calib_info.storage.ni2rms = g_calib_info.acc.ni2rms;
    
    return 0;
}

/******************************************************************************
* Function Name : EM_CALIB_DoAccumulateAngleError
* Interface     : static uint8_t EM_CALIB_DoAccumulateAngleError(uint8_t steps)
* Description   : Accumulate and scan angle error
* Arguments     : steps : choose calibration steps
* Function Calls: EM_CALIB_GetAccumulatedValue()
*               : EM_CALIB_LookupDerivation()
*               : EM_CALIB_ADC_SetAngleError()
*               : EM_CALIB_ADC_SetAngleError()
*               : EM_CALIB_ResetPhaseShiftCircle()
*               : EM_ACC24_Clear()
* Return Value  : uint8_t, 0 is OK, others are fail
******************************************************************************/
static uint8_t EM_CALIB_DoAccumulateAngleError(uint8_t steps)
{
    volatile float32_t   delta_error = 0;
    volatile uint8_t     rlt_code    = EM_CALIB_OK;
    
    /* Check input condition */
    if ((steps != EM_CALIB_ACCUMULATE_STEP_PHASE_ANGLE) &&
        (steps != EM_CALIB_ACCUMULATE_STEP_NEUTRAL_ANGLE))
    {
        return EM_CALIB_ERROR;
    }
    
    /* Set accumulation steps */
    g_calib_step = steps;
    
    /* Reset data storage */
    g_calib_info.number_of_cycles = 0;
    g_calib_info.v_start_flag  = 0;
    
    /* Voltage signal */
    EM_ACC24_Clear(&g_calib_info.acc.vrms);
    g_calib_info.acc.nvrms = 0;
    /* Phase signal */
    EM_ACC24_Clear(&g_calib_info.acc.i1rms);
    g_calib_info.acc.ni1rms = 0;
    /* Power0 signal */
    EM_ACC24_Clear(&g_calib_info.acc.power0_active);
    g_calib_info.acc.npower = 0;
    /* Power1 signal */
    EM_ACC24_Clear(&g_calib_info.acc.power1_active);
    g_calib_info.acc.npower = 0;
    
    g_calib_info.phase_choosen = 0;                                 /* Choose V as referent channel to shift */
    g_calib_info.last_theta = 0;                                    /* Start at 0 degree */
    g_calib_info.theta = 0;                                         /* No setting angle error */
    g_calib_info.derivation =
        EM_CALIB_LookupDerivation(g_calib_info.theta);              /* Get initial value of derivate_value */
    g_calib_info.initial_delta_error = 0;                           /* Init delta error = 0 */
    g_calib_info.last_delta_error = 0;                              /* Haven't update delta error */
    
    EM_CALIB_ResetPhaseShiftCircle();
    
    R_DSADC_AdjustPhaseDelay(g_calib_channel, 0);
    
    /* Wait until finish accumulation */
    g_calib_info.acc.angle_is_done = 0; /* Control sampling for each scanning time */
    g_calib_info.is_finish_calc_angle_error = 0;
    
    while (g_calib_info.is_finish_calc_angle_error == 0)
    {
        if (g_calib_info.acc.angle_is_done == 1)
        {
            /* Assign Accumulator to Storage */
            g_calib_info.storage.power0_active  = EM_CALIB_GetAccumulatedValue(
                    &g_calib_info.acc.power0_active
                                                  );
            g_calib_info.storage.power1_active  = EM_CALIB_GetAccumulatedValue(
                    &g_calib_info.acc.power1_active
                                                  );
            g_calib_info.storage.npower         = g_calib_info.acc.npower;
            
            
            /* delta error (x) = (cos (-phi + theta) / cos (phi + theta) - 1) */
            delta_error  = (g_calib_info.storage.power0_active / g_calib_info.storage.power1_active);
            delta_error -= 1.0f;
            
            /* For 3phase system, current must be leading voltage */
            if (g_calib_info.theta > 0.0f)
            {
                rlt_code = EM_CALIB_ERROR;
                break;
            }
            
            /* Stop if reach max delay time ? */
            if (ABS(g_calib_info.theta) > EM_CALIB_PHASE_ERROR_MAX_ANGLE_ERR)
            {
                g_calib_info.theta = -90.0f;
                rlt_code = EM_CALIB_ERROR;
                break;
            }
            /* Check the range of delta_error, too large */
            else if (delta_error < EM_CALIB_PHASE_ERROR_MIN_THRESHOLD ||
                     delta_error > EM_CALIB_PHASE_ERROR_MAX_THRESHOLD)
            {
                g_calib_info.theta = -180.0f;
                rlt_code = EM_CALIB_ERROR;
                break;
            }
            
            /*
             * Get the initial delta_error, solve for theta,
             * set last_delta_error then start the approximation
             * with the initial theta.
             */
            if (g_calib_info.initial_delta_error == 0.0f)
            {
                /*
                 * Solve for theta
                 *
                 * theta = delta_error / [(delta_error + 2) * tanf(C)]
                 */
                g_calib_info.theta = (
                                         delta_error / (
                                             (delta_error + 2) *
                                             EM_CALIB_TANC
                                         )
                                     );
                                     
                /* Change to degree */
                g_calib_info.theta *= 180.0f;
                g_calib_info.theta /= EM_CALIB_PI;
                
                /* Look up the derivation */
                g_calib_info.derivation = EM_CALIB_LookupDerivation(g_calib_info.theta);
                
                g_calib_info.initial_delta_error = \
                                                   g_calib_info.last_delta_error    = delta_error;
            }
            /* have large error & not change sign ?*/
            else if ((100 * fabsf(delta_error)) >= EM_CALIB_PHASE_ERROR_STOP_THRESHOLD &&
                     (100.0f * delta_error * g_calib_info.last_delta_error > 0.0f))
            {
                /*
                 * Calculate theta, min. grow up is 1step of Phase control register &
                 * Update error, derivation for next approximation
                 */
                g_calib_info.last_delta_error   = delta_error;
                g_calib_info.last_theta         = g_calib_info.theta;
                g_calib_info.theta             -= (
                                                      ((delta_error / g_calib_info.derivation) * 180.0f) /
                                                      EM_CALIB_PI
                                                  );
                g_calib_info.derivation         = EM_CALIB_LookupDerivation(g_calib_info.theta);
            }
            /* archive small error */
            else
            {
                /*
                 * roll back to the last when new error rate larger than the old
                 */
                if (fabsf(g_calib_info.last_delta_error) < fabsf(delta_error))
                {
                    g_calib_info.theta = g_calib_info.last_theta;
                }
                
                g_calib_info.is_finish_calc_angle_error = 1;    /* Finish calculate angle error */
                break;
            }
            
