singhanil2004/RL78_Kwh_Meter/rl78i1c/application/calibration/r_calib_sampling.c
            /* Set new calculated phase angle error */
            if (g_calib_step == EM_CALIB_ACCUMULATE_STEP_PHASE_ANGLE)
            {
                EM_CALIB_ADC_SetAngleError(g_calib_info.theta);
            }
            
            EM_CALIB_ResetPhaseShiftCircle();
            
            g_calib_info.number_of_cycles = 0;
            g_calib_info.v_start_flag  = 0;
            
            /* Reset accumulator */
            EM_ACC24_Clear(&g_calib_info.acc.power0_active);
            EM_ACC24_Clear(&g_calib_info.acc.power1_active);
            g_calib_info.acc.npower = 0;
            
            /* Reset accumulation control flag */
            g_calib_info.acc.angle_is_done = 0;
        }
        
        EM_WDT_Restart();
    }
    
    return rlt_code;
}

#ifdef METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE
/******************************************************************************
* Function Name : EM_CALIB_SamplingForAngle90Error
* Interface     : static uint8_t EM_CALIB_SamplingForAngle90Error(uint8_t steps)
* Description   : Accumulate and scan angle error
* Arguments     : steps : choose calibration steps
* Function Calls: EM_CALIB_GetAccumulatedValue()
*               : EM_CALIB_LookupDerivation()
*               : EM_CALIB_ADC_SetAngleError()
*               : EM_CALIB_ADC_SetAngleError()
*               : EM_CALIB_ResetPhaseShiftCircle()
*               : EM_ACC24_Clear()
* Return Value  : uint8_t, 0 is OK, others are fail
******************************************************************************/
#define CPU_CLK                 (24000000.0f)
#define TAU_TDR                 (TDR01)

static uint8_t EM_CALIB_DoAccumulateAngle90Error(uint8_t steps)
{
    volatile float32_t   step_offset, us_offset, reg_offset;
    volatile float32_t   delta_degree;
    volatile uint8_t     rlt_code    = EM_CALIB_OK;
    volatile float32_t backup_vrms, backup_i1rms;
    volatile float32_t apparent_like;
    volatile float32_t require_steps;
    volatile float32_t require_fsteps;
    volatile float32_t require_tdr_setting;
    volatile int16_t inital_reg;
    uint32_t i;
    
    /* Set accumulation steps */
    g_calib_step = steps;
    
    /* Reset data storage */
    g_calib_info.number_of_cycles = 0;
    g_calib_info.v_start_flag  = 0;
    
    /* Clear accumulator */
    /* Voltage signal */
    EM_ACC24_Clear(&g_calib_info.acc.vrms);
    g_calib_info.acc.nvrms = 0;
    /* Phase signal */
    EM_ACC24_Clear(&g_calib_info.acc.i1rms);
    g_calib_info.acc.ni1rms = 0;
    /* Power0 signal */
    EM_ACC24_Clear(&g_calib_info.acc.power0_active);
    g_calib_info.acc.npower = 0;
    
    g_calib_info.theta90 = 0;
    
    /* Wait until finish accumulation */
    g_calib_info.acc.angle_is_done = 0; /* Control sampling for each scanning time */
    g_calib_info.is_finish_calc_angle_error = 0;
    
    /* Backup the VRMS and IRMS */
    backup_vrms = g_calib_info.storage.vrms;
    backup_i1rms = g_calib_info.storage.i1rms;
    
    /* Calculate the ideal require steps */
    
    require_steps = ((90.0f / 360.0f) * EM_ADC_DRIVER_IDEAL_SAMPLING_FREQUENCY) / (EM_CALIB_LINE_FREQUENCY);
    
    g_wrp_adc_voltage90_circle_step = (uint8_t)require_steps + EM_ADC_DELAY_STEP_VOLTAGE + 1;
    
    g_wrp_adc_tdr_ignore = 0;
    
    for (i = 0; i < 20; i++)
    {
        MCU_Delay(50000);
    }
    
    require_fsteps = 1 - (require_steps - (uint8_t)require_steps);
    
    require_fsteps = ((uint16_t)((require_fsteps + 0.005f) * 100.0f)) / 100.0f;
    
    require_tdr_setting = (require_fsteps / EM_ADC_DRIVER_IDEAL_SAMPLING_FREQUENCY) * (float32_t)CPU_CLK;
    
    TAU_TDR = (uint16_t)require_tdr_setting;
    
    inital_reg = TAU_TDR;
    
    while (g_calib_info.is_finish_calc_angle_error == 0)
    {
        if (g_calib_info.acc.angle_is_done == 1)
        {
            /* Assign Accumulator to Storage */
            g_calib_info.storage.power0_active  = EM_CALIB_GetAccumulatedValue(
                    &g_calib_info.acc.power0_active
                                                  );
                                                  
            g_calib_info.storage.vrms   = EM_CALIB_GetAccumulatedValue(
                                              &g_calib_info.acc.vrms
                                          );
                                          
            g_calib_info.storage.i1rms  = EM_CALIB_GetAccumulatedValue(
                                              &g_calib_info.acc.i1rms
                                          );
                                          
            g_calib_info.storage.npower         = g_calib_info.acc.npower;
            
            /*******************************************
             * Calculation method:
             * Apparent power   = VRMS*IRMS
             * Active power     = VRMS*IRMS*cos(theta)
             *                      Active
             * ==> theta = acos(---------------)
             *                      Apparent
             *
             * ****************************************/
            
            g_calib_info.storage.vrms = EM_sqrt(g_calib_info.storage.vrms /
                                                g_calib_info.storage.npower);
                                                
            g_calib_info.storage.i1rms = EM_sqrt(g_calib_info.storage.i1rms /
                                                 g_calib_info.storage.npower);
                                                 
            g_calib_info.storage.power0_active = (g_calib_info.storage.power0_active /
                                                  g_calib_info.storage.npower);
                                                  
            apparent_like = g_calib_info.storage.vrms * g_calib_info.storage.i1rms;
            
            g_calib_info.theta90 = g_calib_info.storage.power0_active / apparent_like;
            
            g_calib_info.theta90 = acos(g_calib_info.theta90);
            
            g_calib_info.theta90 *= 180.0f;
            g_calib_info.theta90 /= EM_CALIB_PI;
            
            delta_degree = 90.0f - g_calib_info.theta90;
            
            
            if (delta_degree > 2.4f || delta_degree < -2.4f)
            {
                rlt_code = EM_CALIB_ERROR;
                break;
            }
            else if (delta_degree >= 0.010f || delta_degree <= -0.010f)
            {
                /*********************************************************************
                 * Calculate the new value of TDR by ratio to target degree:
                 *
                 * dtheta = 90 - measured_theta
                 *
                 *
                 *              dtheta * fs
                 * dstep = ----------------------
                 *               360 * fac
                 *
                 *              dstep * 10e5
                 * dus = ------------------------
                 *                  fs
                 *
                 *                  dus
                 * dTDR = -----------------------
                 *          (1/CPU_CLK) * 10e5
                 *
                 *
                 *              dtheta * CPUCLK
                 * ==> dTDR = -------------------
                 *                 360 * fac
                 *
                 * TDR(n+1) = TDR(n) - dTDR
                 *
                 *******************************************************************/
                reg_offset = (delta_degree * CPU_CLK) / (360.0f * EM_CALIB_LINE_FREQUENCY);
                /* Scaling with rise coefficient */
                reg_offset = reg_offset * 0.7;
                TAU_TDR -= reg_offset;
            }
            else /* Within error range, save the result and exit */
            {
                reg_offset = (inital_reg - (int16_t)TAU_TDR);
                g_calib_info.theta90_timer_offset = reg_offset;
                g_calib_info.is_finish_calc_angle_error = 1;
                TAU_TDR = inital_reg;   /* restore the initial setting */
                
                /* Restore the VRMS and IRMS */
                g_calib_info.storage.vrms = backup_vrms ;
                g_calib_info.storage.i1rms = backup_i1rms ;
                
                break;
            }
            
