singhanil2004/RL78_Kwh_Meter/rl78i1c/application/calibration/r_calib_sampling.c
            g_calib_info.number_of_cycles = 0;
            g_calib_info.v_start_flag  = 0;
            
            /* Reset accumulator */
            EM_ACC24_Clear(&g_calib_info.acc.vrms);
            EM_ACC24_Clear(&g_calib_info.acc.i1rms);
            EM_ACC24_Clear(&g_calib_info.acc.power0_active);
            g_calib_info.acc.nvrms = 0;
            g_calib_info.acc.ni1rms = 0;
            g_calib_info.acc.npower = 0;
            
            /* Reset accumulation control flag */
            g_calib_info.acc.angle_is_done = 0;
        }
        
        EM_WDT_Restart();
    }
    
    return rlt_code;
}
#endif /* METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE */

/******************************************************************************
* Function Name : EM_CALIB_Sampling
* Interface     : void EM_CALIB_Sampling(void)
* Description   : Do sampling for calibration module
*               : Callback function which is used to register into ADC ISR
* Arguments     : None
* Function Calls: EM_CALIB_SamplingForFs()
*               : EM_CALIB_SamplingForCalcGain()
*               : EM_CALIB_SamplingForAngleError()
*               : EM_CALIB_SamplingForAccSignals()
* Return Value  : None
******************************************************************************/
void EM_CALIB_Sampling(NEAR_PTR EM_SAMPLES* p_samples)
{
    if (g_calib_line == 0)
    {
        g_sample_v      = (int16_t)p_samples->phase_r.v;
        g_sample_v90    = (int16_t)p_samples->phase_r.v90;
        g_sample_i      = p_samples->phase_r.i;
    }
    else if (g_calib_line == 1)
    {
        g_sample_v      = (int16_t)p_samples->phase_y.v;
        g_sample_v90    = (int16_t)p_samples->phase_y.v90;
        g_sample_i      = p_samples->phase_y.i;
    }
    else if (g_calib_line == 2)
    {
        g_sample_v      = (int16_t)p_samples->phase_b.v;
        g_sample_v90    = (int16_t)p_samples->phase_b.v90;
        g_sample_i      = p_samples->phase_b.i;
    }
    else
    {
        g_sample_i      = p_samples->neutral.i;
    }
    
    EM_CALIB_SamplingUpdateOffset();
    
    g_sample_v = RL78I1C_DoSoftwareHPF16(g_sample_v, 0);
    g_sample_v90 = RL78I1C_DoSoftwareHPF16(g_sample_v90, 1);
    
    if (g_calib_info.stable_count <  EM_CALIB_SIGNAL_CYCLE_FOR_STABILITY)
    {
        g_calib_info.stable_count++;
        return;
    }
    
    
    if (g_calib_step == EM_CALIB_ACCUMULATE_STEP_FS)
    {
        EM_CALIB_SamplingForFs();
    }
    else if (g_calib_step == EM_CALIB_ACCUMULATE_STEP_IGAIN)
    {
        EM_CALIB_SamplingForCalcGain();
    }
    else if ((g_calib_step == EM_CALIB_ACCUMULATE_STEP_PHASE_ANGLE) ||
             (g_calib_step == EM_CALIB_ACCUMULATE_STEP_NEUTRAL_ANGLE))
    {
        EM_CALIB_SamplingForAngleError();
    }
    else if ((g_calib_step == EM_CALIB_ACCUMULATE_STEP_V90_ANGLE))
    {
        EM_CALIB_SamplingForAngle90Error();
    }
    else if ((g_calib_step >= EM_CALIB_ACCUMULATE_STEP_V)   &&
             (g_calib_step <= (EM_CALIB_ACCUMULATE_STEP_V  |
                               EM_CALIB_ACCUMULATE_STEP_IP |
                               EM_CALIB_ACCUMULATE_STEP_IN
                              ))
            )
    {
        EM_CALIB_SamplingForAccSignals();
    }
}


/******************************************************************************
* Function Name : EM_CALIB_SamplingForFs
* Interface     : static void EM_CALIB_SamplingForFs(void)
* Description   : Count up the number of ADC ISR in 1s
* Arguments     : None
* Function Calls: None
* Return Value  : Total number of ADC ISR
******************************************************************************/
static void EM_CALIB_SamplingUpdateOffset(void)
{
    volatile int32_t v, i, v90;
    volatile uint8_t zx;
    static int32_t v_old;
    
    g_calib_info.offset.v.acc       += g_sample_v;
    g_calib_info.offset.i.acc       += g_sample_i;
    
    v = g_sample_v;
    v90 = g_sample_v90;
    i = g_sample_i;
    
    v   -= g_calib_info.offset.v.average;
    v90 -= g_calib_info.offset.v.average;
    i   -= g_calib_info.offset.i.average;
    
    g_calib_info.offset.number_of_samples++;
    
    if ((v >= 0) && (v_old < 0))
    {
        g_calib_info.offset.number_of_cycles++;
    }
    
    v_old = v;
    
    if (g_calib_info.offset.number_of_cycles >= EM_CALIB_OFFSET_CYCLE_FOR_AVERAGE ||
        g_calib_info.offset.number_of_samples >= EM_CALIB_OFFSET_DEFAULT_NSAMPLE)
    {
        g_calib_info.offset.v.average = (
                                            g_calib_info.offset.v.acc / g_calib_info.offset.number_of_samples
                                        );
                                        
        g_calib_info.offset.v.average = (g_calib_info.offset.v.average + \
                                         g_calib_info.offset.v.average_prev) / 2;
                                         
        g_calib_info.offset.v.average_prev = g_calib_info.offset.v.average;
        
        g_calib_info.offset.i.average = (
                                            g_calib_info.offset.i.acc / g_calib_info.offset.number_of_samples
                                        );
                                        
        g_calib_info.offset.i.average = (g_calib_info.offset.i.average + \
                                         g_calib_info.offset.i.average_prev) / 2;
                                         
        g_calib_info.offset.i.average_prev = g_calib_info.offset.i.average;
        
        g_calib_info.offset.v_count++;
        
        /* Check for offset ready */
        if (g_calib_info.offset.v_count >= EM_CALIB_OFFSET_STABILIZATION_COUNT)
        {
            g_calib_info.offset.v_ready = 1;
            g_calib_info.offset.v_count = 0;
        }
        
        g_calib_info.offset.v.acc = 0;
        g_calib_info.offset.i.acc = 0;
        g_calib_info.offset.number_of_cycles = 0;
        g_calib_info.offset.number_of_samples = 0;
    }
    
    return;
}

/******************************************************************************
* Function Name : EM_CALIB_SamplingForFs
* Interface     : static void EM_CALIB_SamplingForFs(void)
* Description   : Count up the number of ADC ISR in 1s
* Arguments     : None
* Function Calls: None
* Return Value  : Total number of ADC ISR
******************************************************************************/
static void EM_CALIB_SamplingForFs(void)
{
    MCU_Delay(20);
    
    if (g_calib_is_start_count_sample == 1)
    {
        g_calib_info.fs.nsample++;
    }
}

