singhanil2004/RL78_Kwh_Meter/rl78i1c/application/calibration/r_calib_sampling.c
/******************************************************************************
* Function Name : EM_CALIB_SamplingForCalcGain
* Interface     : static void EM_CALIB_EM_CALIB_SamplingForCalcGain(void)
* Description   : Control sampling process for calculating current gain
* Arguments     : None
* Function Calls: EM_ADC_GetSamples()
* Return Value  : Max value of i1 sample and i2 sample
******************************************************************************/
static void EM_CALIB_SamplingForCalcGain(void)
{
    static uint16_t nsample = 0;
    
    if (g_calib_info.gain.idone == 1)
    {
        return;
    }
    
    if (g_calib_info.gain.is_start == 0)
    {
        g_calib_info.gain.is_start = 1;
        /* Set initial value for imax and i1min */
        g_calib_info.gain.imax = g_sample_i;
    }
    
    /* Check starting point */
    if (g_calib_info.gain.is_start == 1)
    {
        /* Find max value of i1 */
        if (g_calib_info.gain.imax < g_sample_i)
        {
            g_calib_info.gain.imax = g_sample_i;
        }
        
        /* Increase the number of current sample */
        nsample++;
        
        if (nsample >= EM_CALIB_NUM_SAMPLE_FOR_CALC_GAIN)
        {
            /* Set flag to confirm finish sampling process */
            g_calib_info.gain.idone = 1;
            /* Reset start flag for g_sample_i */
            g_calib_info.gain.is_start = 0;
            nsample = 0;
        }
    }
}

/******************************************************************************
* Function Name : EM_CALIB_SamplingForAngleErr
* Interface     : static void EM_CALIB_SamplingForAngleErr(void)
* Description   : Sampling for calculate angle error
* Arguments     : None
* Function Calls: EM_ADC_GetSamples()
*               : EM_CALIB_DoPhaseShift0()
*               : EM_CALIB_DoPhaseShift1()
*               : EM_ACC24_Add()
* Return Value  : None
******************************************************************************/
static void EM_CALIB_SamplingForAngleError(void)
{
    volatile int32_t     v_shifted       = 0;
    volatile int32_t     i_shifted       = 0;
    
    volatile uint16_t    i_mask = 0;
    volatile uint16_t    i_shifted_mask = 0;
    volatile uint16_t    v_mask = 0;
    volatile uint16_t    v_shifted_mask = 0;
    
    volatile uint8_t     zx = 0; /* ZX flag */
    volatile static uint16_t num_sample = 0;
    volatile static int32_t  v_old = 0;
    
    //    if (g_calib_info.offset.v_ready == 1)       /* Offset remmoval when v offset is ready */
    //    {
    //        g_sample_v -= g_calib_info.offset.v.average;            /* Remove offset */
    //        g_sample_i -= g_calib_info.offset.i.average;            /* Remove offset */
    //    }
    //    else
    //    {
    //        return;
    //    }
    
    if ((g_calib_info.is_finish_calc_angle_error == 1) ||
        (g_calib_info.acc.angle_is_done == 1))
    {
        return;
    }
    
    /* Shift voltage and current to create power0 and power1 */
    v_shifted = EM_CALIB_DoPhaseShift0(g_sample_v, EM_CALIB_CIRCLE_DELAY_STEP); /* v shifted - ~59.90 : i lead v */
    i_shifted = EM_CALIB_DoPhaseShift1(g_sample_i, EM_CALIB_CIRCLE_DELAY_STEP); /* i shifted - ~59.90 : i lag v */
    
    /* Detect ZX */
    if ((g_sample_v >= 0) && (v_old < 0))
    {
        zx = 1;
        
        if ((g_calib_phase_shift0_ready == 1)   &&  /* Finish shifting to calculate power 0 */
            (g_calib_phase_shift1_ready == 1)   &&  /* Finish shifting to calculate power 1 */
            (g_calib_info.v_start_flag  == 0))      /* Haven't start sampling process */
        {
            g_calib_info.v_start_flag = 1;
            g_calib_phase_shift0_ready = 0;
            g_calib_phase_shift1_ready = 0;
        }
    }
    
    v_old = g_sample_v;
    
    if (g_calib_info.v_start_flag == 1) /* Start sampling process */
    {
        /* Count up number of line cycle */
        if (zx == 1)
        {
            g_calib_info.number_of_cycles++;
        }
        
        if (g_calib_info.number_of_cycles < g_calib_number_cycles_phase_error)
        {
            /*
             * Calculate Power0 = v_shifted * i
             */
            EM_ACC24_Add(&g_calib_info.acc.power0_active, v_shifted, g_sample_i);
            
            /*
             * Calculate Power1 = g_sample_v * i_shifted
             */
            EM_ACC24_Add(&g_calib_info.acc.power1_active, g_sample_v, i_shifted);
            
            /* Count up number of samples */
            num_sample++;
        }
        else
        {
            /* Assign total number samples */
            g_calib_info.acc.npower = num_sample;
            num_sample = 0;
            /* Set flag to confirm finish 1 sampling turn */
            g_calib_info.acc.angle_is_done = 1;
            v_old = 0;
        }
    }
    
    zx = 0;
}

/******************************************************************************
* Function Name : EM_CALIB_SamplingForAngle90Error
* Interface     : static void EM_CALIB_SamplingForAngle90Error(void)
* Description   : Sampling for calculate angle error between v and v90
* Arguments     : None
* Function Calls: EM_ADC_GetSamples()
*               : EM_ACC24_Add()
* Return Value  : None
******************************************************************************/
static void EM_CALIB_SamplingForAngle90Error(void)
{
    volatile uint16_t    i_mask = 0;
    volatile uint16_t    v90_mask = 0;
    
    volatile uint8_t     zx = 0; /* ZX flag */
    static uint16_t num_sample = 0;
    static int32_t  v_old = 0;
    
    if ((g_calib_info.is_finish_calc_angle_error == 1) ||
        (g_calib_info.acc.angle_is_done == 1))
    {
        return;
    }
    
    /* Detect ZX */
    if ((g_sample_v90 >= 0) && (v_old < 0))
    {
        zx = 1;
        
        if ((g_calib_info.v_start_flag  == 0))      /* Haven't start sampling process */
        {
            g_calib_info.v_start_flag = 1;
        }
    }
    
    v_old = g_sample_v90;
    
    if (g_calib_info.v_start_flag == 1) /* Start sampling process */
    {
        /* Count up number of line cycle */
        if (zx == 1)
        {
            g_calib_info.number_of_cycles++;
        }
        
