singhanil2004/RL78_Kwh_Meter/rl78i1c/application/calibration/r_calib_sampling.c
        if (g_calib_info.number_of_cycles < g_calib_number_cycles_phase_error)
        {
        
            EM_ACC24_Add(&g_calib_info.acc.vrms, g_sample_v90, g_sample_v90);
            
            //          EM_ACC24_Add(&g_calib_info.acc.i1rms, g_sample_i, g_sample_i);
            EM_ACC24_Add(&g_calib_info.acc.i1rms, g_sample_v, g_sample_v);
            
            /*
             * Calculate Power0 = v_shifted * g_sample_i
             */
            /* All signals are LSB ? */
            EM_ACC24_Add(&g_calib_info.acc.power0_active, g_sample_v90, g_sample_v);
            
            /* Count up number of samples */
            num_sample++;
        }
        else
        {
            /* Assign total number samples */
            g_calib_info.acc.npower = num_sample;
            num_sample = 0;
            /* Set flag to confirm finish 1 sampling turn */
            g_calib_info.acc.angle_is_done = 1;
            v_old = 0;
        }
    }
    
    zx = 0;
}

/******************************************************************************
* Function Name : EM_CALIB_SamplingForAccSignals
* Interface     : static void EM_CALIB_SamplingForAccSignals(void)
* Description   : Control sampling process for accumulation
* Arguments     : None
* Function Calls: EM_ADC_GetSamples()
*               : EM_ACC24_Add()
* Return Value  : None
******************************************************************************/
static void EM_CALIB_SamplingForAccSignals(void)
{
    volatile uint8_t         v_zx                = 0;    /* ZX flag for volt */
    volatile uint8_t         i_zx                = 0;    /* ZX flag for phase */
    static int32_t  v_old               = 0;    /* Detect ZX of voltage signal */
    static int32_t  i_old               = 0;    /* Detect ZX of phase signal */
    
    static uint16_t v_num_cycle         = 0;    /* Line counter for volt signal */
    static uint16_t i_num_cycle         = 0;    /* Line counter for phase signal */
    static uint16_t v_num_sample        = 0;
    static uint16_t i_num_sample        = 0;
    
    static uint8_t  step_mask   = 0;
    
    volatile uint16_t     v_mask = 0;
    volatile uint16_t    i_mask = 0;
    
    if (g_calib_info.acc.is_done == 1)
    {
        return;
    }
    
    /* Accumulated voltage signal */
    if (((g_calib_step  & EM_CALIB_ACCUMULATE_STEP_V) != 0) &&
        ((step_mask     & EM_CALIB_ACCUMULATE_STEP_V) == 0))
        
    {
        /* Detect ZX */
        if ((g_sample_v >= 0) && (v_old < 0))
        {
            v_zx = 1;
            
            if (g_calib_info.v_start_flag == 0)
            {
                g_calib_info.v_start_flag = 1;
            }
        }
        
        v_old = g_sample_v;
        
        /* Check starting point */
        if (g_calib_info.v_start_flag == 1)
        {
            /* Accumulate into LSB */
            EM_ACC24_Add(&g_calib_info.acc.vrms, g_sample_v, g_sample_v);
            
            /* Increase number of sample */
            v_num_sample++;
            
            /* Check ZX */
            if (v_zx == 1)
            {
                v_num_cycle++;
            }
            
            /* The total number of cycles equal expected line cycles */
            if (v_num_cycle >= g_calib_number_cycles)
            {
                /* Assign total number of sample */
                g_calib_info.acc.nvrms = v_num_sample;
                v_num_sample = 0;
                g_calib_info.v_start_flag = 0;
                v_num_cycle = 0;
                v_old = 0;
                /* Change mask */
                step_mask |= EM_CALIB_ACCUMULATE_STEP_V;
            }
        }
    }
    
    /* Accumulated phase current signal */
    if (((g_calib_step  & EM_CALIB_ACCUMULATE_STEP_IP) != 0)    &&
        ((step_mask     & EM_CALIB_ACCUMULATE_STEP_IP) == 0))
        
    {
        /* Detect ZX */
        if ((g_sample_i >= 0) && (i_old < 0))
        {
            i_zx = 1;
            
            if (g_calib_info.i1_start_flag == 0)
            {
                g_calib_info.i1_start_flag = 1;
            }
        }
        
        i_old = g_sample_i;
        
        /* Check starting point */
        if (g_calib_info.i1_start_flag == 1)
        {
            /* Accumulate */
            EM_ACC24_Add(&g_calib_info.acc.i1rms, g_sample_i, g_sample_i);
            
            /* Increase number of sample */
            i_num_sample++;
            
            /* Check ZX */
            if (i_zx == 1)
            {
                i_num_cycle++;
            }
            
            /* The total number of cycles equal expected line cycles */
            if (i_num_cycle >= g_calib_number_cycles)
            {
                g_calib_info.acc.ni1rms = i_num_sample;
                i_num_sample = 0;
                g_calib_info.i1_start_flag = 0;
                i_num_cycle = 0;
                i_old = 0;
                /* Change mask */
                step_mask |= EM_CALIB_ACCUMULATE_STEP_IP;
            }
        }
    }
    
    v_zx = 0;
    i_zx = 0;
    
    /* Check sampling status */
    if (step_mask == g_calib_step)
    {
        g_calib_info.acc.is_done = 1;
        step_mask = 0;
    }
}

/******************************************************************************
* Function Name : EM_CALIB_RTCConstantInterruptCallback
* Interface     : void EM_CALIB_RTCConstantInterruptCallback(void)
* Description   : Callback function, which is used to registered into driver layer
* Arguments     : None
* Function Calls: None
* Return Value  : None
******************************************************************************/
void EM_CALIB_RTCConstantInterruptCallback(void)
{
    static uint8_t is_start_count_time = 0;
    static uint8_t rtc_int_counter = 0;
    
    if (g_calib_start_count_1s == 0)
    {
        return;
    }
    
    if (is_start_count_time == 0)   /* First time detect RTC interrupt */
    {
        is_start_count_time = 1;
        /* Start count sample */
        g_calib_is_start_count_sample = 1;
        /* Set RTC counter value */
#if ((defined EM_CALIB_RTC_CONSTANT_PERIOD) && (EM_CALIB_RTC_CONSTANT_PERIOD == 1000))
        rtc_int_counter = 1;
#elif ((defined EM_CALIB_RTC_CONSTANT_PERIOD) && (EM_CALIB_RTC_CONSTANT_PERIOD == 500))
        rtc_int_counter = 2;
#else
#error "Just choose RTC constant interrupt ONESEC or HALFSEC"
#endif /* (defined EM_CALIB_RTC_CONSTANT_PERIOD) && (EM_CALIB_RTC_CONSTANT_PERIOD == 1000) */
    }
    else    /* From the second time detect RTC interupt */
    {
        rtc_int_counter--;
        
        if (rtc_int_counter == 0)
        {
            g_calib_is_start_count_sample = 0;
            is_start_count_time = 0;
            /* Set flag to confirm finish couting fs */
            g_calib_info.fs.is_done = 1;
        }
    }
}
